[{"title":"2017.4.7 ORID","date":"2017-04-07T14:08:02.000Z","path":"2017/04/07/2017-4-7-ORID/","text":"Objective关于今天的知识, 你记得什么? hexo的个人博客搭建，见证了一些大神的作品，心中极为震撼。熟悉了一些技术细节，将写在前端学习里。 完成了什么? hexo的搜索功能，disqus留言板功能，cotegory,tags功能，markdown发布第一篇个人博客。 Reflective你要如何形容今天的情绪 渐渐进入一种痴迷状态，痴迷，就是要被酷的东西吸引。被打断很暴躁，这需要注意。 今天的高峰是什么? 当我看到大神亮瞎眼的github账号，所开发的精美的博客模板，淡定清秀的笑容，充满美感的摄影，清新的文笔，还有对音乐游戏的高度审美，羞涩谦虚的态度，不禁痴迷，震撼。 今天的低点是什么? disqus装不上时深深焦虑。 Interpretive我们今天学到了什么? 自己的心态仍需要锻炼，遇到需要了解的英文文档，要耐心把它看完。 需要我搜索的问题，一定要注意用英文关键字Google。自己琢磨接近3小时没有成果，Google瞬间找到了方向。 今天一个重要的领悟是什么? 以后一定要学好英文，这样可以直接看原文技术文档。中文二手翻译资料好多不详细，而且因为软件版本变化，不看最新官方说明文档使用相关软件和服务简直是盲人摸象。零零碎碎地看中英文教程相当于随机抽牌比牌面，有英文技术文档阅读能力则相当于拥有透视眼直接看穿所有牌面。 Decisional我们会如何用一句话形容今天的工作 直到被node.js搞得痛不欲生，才知道Github Pages免费博客可以用ruby做，以后思考问题一定要想到离自己最近的工具。一定要学好ruby，然后用ruby做一个致敬前辈的一模一样的网站。 有哪些工作需要明天继续努力? 继续熟悉job-listing的开发思路，把代码做一遍。然后看全栈营其它学长学姐的作品，学习3个相关功能。然后带着问题参加晚上的meetup。","tags":[]},{"title":"2017.4.6 ORID","date":"2017-04-07T05:44:01.000Z","path":"2017/04/07/2017-4-6-ORID/","text":"Objective关于今天的课程, 你记得什么? job-listing的开发。 完成了什么? 自己完成了一部分功能，体会到了迁移思考的过程，这跟直接抄答案是完全不一样的。 Reflective你要如何形容今天的情绪 总体较好。能够控制自己的情绪。 今天的高峰是什么? 线上meetup的分享。 今天的低点是什么? 怕写代码失败。看到少数几个人已经提交了作业，也想要提前交作业，这种心态不是很好。 Interpretive我们今天学到了什么? 进一步记录自己的时间花费 今天一个重要的领悟是什么? 有问题可以自己琢磨，但也可以先Google。要注意哪种方法更高效。 Decisional我们会如何用一句话形容今天的工作 还可以吧，保证了时间上的投入。 有哪些工作需要明天继续努力? 继续熟悉job-listing的开发思路。 开始弄自己的个人网站，先把首页弄出来。要怀着开心兴奋探索的心情去做这件事。","tags":[{"name":"ORID","slug":"ORID","permalink":"https://peckliu2017.github.io/tags/ORID/"}]},{"title":"Hello World","date":"2017-04-01T19:37:02.000Z","path":"2017/04/02/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","tags":[]}]